[M_ChosenOne MissionDefinition]
MissionName="The chosen ones"
MissionDescription="ECHO CEO Kai owes Signature nine dollars and Recommendations: asks him to collect it. But Kai is missing, and the only clues to his whereabouts come from scraps of what he discovers on Pandora.."
TurnInDescription="You will be reunited with the love of Marcus' life and learn about the prophecy along the way.."
MissionSummary="Kai gave him $9.."
MissionGiver="Marcus"
MissionTurnInLocation="Marcus"
TeaserText="How good is the crash?..."

[M_ChosenOne:FinalObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ChosenOne:FindEchos MissionObjectiveDefinition]
ProgressMessage="COLLECT ECHOS HEROES"

[M_ChosenOne:FindKai MissionObjectiveDefinition]
ProgressMessage="Find the moss"

[M_ChosenOne:FindKaiAndEchosSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ChosenOne:GrabMoney MissionObjectiveDefinition]
ProgressMessage="Take 9$"

[M_ChosenOne:GrabMoneySet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

